# Wattage Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialWattageIntensity..::..Wattage Property
InitialWattageIntensity Class See Also
---
The wattage value.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Wattage { get; set; }
```

Visual Basic
---
```text
Public Property Wattage As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Wattage {
	double get ();
	void set (double value);
}
```

# ### Field Value
The wattage value in W as a numerical value between 0 and 1e+30.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The wattage value is not valid because it is not between 0 and 1e+30. |

# See Also
InitialWattageIntensity Class
Autodesk.Revit.DB.Lighting Namespace